from gmpy2 import *

cipher = [4396, 22819, 47998, 47995, 40007, 9235, 21625, 25006, 4397, 51534, 46680, 44129, 38055, 18513, 24368, 38451, 46240, 20758, 37257, 40830, 25293, 38845, 22503, 44535, 22210, 39632, 38046, 43687, 48413, 47525, 23718, 51567, 23115, 42461, 26272, 28933, 23726, 48845, 21924, 46225, 20488, 27579, 21636]

sorted = [0] * 43
for c in cipher:
    for i in range(len(cipher)):
        # iの値を特定することにより、cipherを整列
        if iroot(c-i,2)[1]: sorted[i] = iroot(c,2)[0]

flag = ['c', 't'] + ['']*42 
for i in range(42):
    flag[i+2] = chr((sorted[i+1] - sorted[i]) + ord(flag[i]))

print("".join(flag))
